# Part 19

In [20]:
import pandas as pd
import numpy as np

# Persiapan Data Frame

In [21]:
n_rows = 5
n_cols = 2
cols = ['omset','operasional']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df

   omset  operasional
0     17           15
1     17            3
2     10            7
3     17            3
4     10            6

In [22]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0  1700000       150000
1  1700000        30000
2  1000000        70000
3  1700000        30000
4  1000000        60000

In [23]:
df.index = pd.util.testing.makeDateIndex(n_rows,freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operasional
0 2000-01-01  1700000       150000
1 2000-01-02  1700000        30000
2 2000-01-03  1000000        70000
3 2000-01-04  1700000        30000
4 2000-01-05  1000000        60000

# Melakukan Formatting Tampilan Data Frame

In [24]:
formatku = {
    "tanggal":"{:%d/%m/%y}",
    "operasional":"Rp {:.2f}",
    "omset":"Rp {:.2f}"
}

laporan = df.style.format(formatku)
laporan

In [25]:
type(laporan)
# laporan.head() Sudah Bukan Berbentuk Object DataFrame

pandas.io.formats.style.Styler

In [26]:
laporan.hide_index()

C:\Users\alima\AppData\Local\Temp\ipykernel_14304\2689267819.py:1: FutureWarning: this method is deprecated in favour of `Styler.hide(axis="index")`
  laporan.hide_index()

In [27]:
laporan.set_caption('Laporan Data Omset Dan Operasional')

In [28]:
laporan.highlight_min('omset',color='red')
laporan.highlight_max('omset',color='yellow')

laporan.highlight_min('operasional',color='lightblue')
laporan.highlight_max('operasional',color='grey')